linux/2014-10-03-publish-org.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Publish Org</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Micky Ching" />
<link rel="stylesheet" type="text/css" href="../style/default.css" />


</head>
<body>
<div id="content">
<h1 class="title">Publish Org</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 简介</a>
<ul>
<li><a href="#sec-1-1">1.1. emacs org mode配置</a></li>
<li><a href="#sec-1-2">1.2. org mode发布脚本</a></li>
<li><a href="#sec-1-3">1.3. 生成pdf</a></li>
<li><a href="#sec-1-4">1.4. 生成html</a></li>
<li><a href="#sec-1-5">1.5. 生成jekyll</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 简介</h2>
<div class="outline-text-2" id="text-1">
<p>
org mode是emacs下一个非常强大的主模式。
这里不介绍org mode的用法，而是介绍如何将org mode生成各种格式的文档。
</p>

<p>
org mode提供了一中可以直接在编辑区导出所需文档的方法，
这个方法的弊端是导出的过程中将不能做任何编辑工作。
一种理想的方式是写Makefile，如同写latex一样，
但是Makefile一方面需要在每个项目下编写，比较费事，
另一方面从org mode的导出方式来看，似乎并不适合用Makefile。
</p>

<p>
于是我这里采用了一种emacs配置文件加python脚本的方式进行发布。
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> emacs org mode配置</h3>
<div class="outline-text-3" id="text-1-1">
<p>
我的eamcs配置可以通过如下方式获得
</p>
<div class="org-src-container">

<pre class="src src-sh">git clone https://github.com/mickyching/emacsd.git
</pre>
</div>
<p>
和org mode相关的配置都放在 <code>lisp/mc-org.el</code> 配置文件中，
</p>

<p>
虽然希望直接拿一个配置文件就可以编译，但实际上是不行的，
因为最起码还需要color-theme插件的支持，以生成漂亮的源代码。
所以至少需要安装插件color-theme和org。
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> org mode发布脚本</h3>
<div class="outline-text-3" id="text-1-2">
<p>
发布脚本名字为 <a href="src/scripts/puborg.py"><code>puborg.py</code></a> ，依赖另一个文件 <a href="src/scripts/bin_simops.py"><code>bin_simops.py</code></a> ，
可以发布多种格式的文档。
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 生成pdf</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-sh">puborg -d dirs...                       <span style="color: #228b22; font-style: italic;"># </span><span style="color: #228b22; font-style: italic;">&#29983;&#25104;pdf&#25991;&#26723;</span>
puborg -s dirs...                       <span style="color: #228b22; font-style: italic;"># </span><span style="color: #228b22; font-style: italic;">&#29983;&#25104;pdf&#28436;&#31034;</span>
</pre>
</div>
<p>
如果是生成pdf文档，会对每个目录下面的org文件生成pdf文档，
因此要确保路径下面的每个org文件都能够生成pdf文档，否则会出错。
生成pdf演示要求相同。
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 生成html</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-sh">puborg -i dirs...                       <span style="color: #228b22; font-style: italic;"># </span><span style="color: #228b22; font-style: italic;">&#29983;&#25104;html index</span>
puborg -p dirs...                       <span style="color: #228b22; font-style: italic;"># </span><span style="color: #228b22; font-style: italic;">&#29983;&#25104;html</span>
</pre>
</div>
<p>
html index和html的区别在于二者使用的css和js路径不同，
html index使用的是当前路径，而html使用的是父目录。
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 生成jekyll</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">

<pre class="src src-sh">puborg -j dirs...
</pre>
</div>
<p>
gh-pages使用jekyll引擎，故加上jekyll输出。
我们假定jekyll目录位于 <code>~/.org-pages/</code> ，如果不是可以添加一个符号链接。
指定的目录作为category，
插入的图片必须位于fig目录下，引用的源代码必须位于src目录下，
并且最好位于它们的子目录下。
</p>

<p>
插入图片和源代码要使用相对路径，
在发布到jekyll的时候就会用脚本转换为绝对路径。
所有的附件将被导入到 <code>~/.org-pages/source/</code> 中去。
</p>
</div>
</div>
</div>
</div>
</body>
</html>
